; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	image1 - mode
	spectrograph0 - mode
	spectrograph4 - mode
	spectrograph3 - mode
	spectrograph2 - mode
	Star0 - direction
	Star7 - direction
	Star9 - direction
	GroundStation6 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star8 - direction
	Star4 - direction
	Star5 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 image1)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 Star9)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star5)
	(supports instrument2 image1)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument3 spectrograph3)
	(supports instrument3 image1)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 spectrograph0)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 Star9)
	(supports instrument5 spectrograph0)
	(supports instrument5 spectrograph2)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 Star8)
	(calibration_target instrument5 Star5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument6 spectrograph3)
	(supports instrument6 image1)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 Star8)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 GroundStation3)
	(supports instrument8 spectrograph0)
	(supports instrument8 spectrograph4)
	(calibration_target instrument8 Star5)
	(calibration_target instrument8 Star4)
	(calibration_target instrument8 Star8)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
)
(:goal (and
	(have_image Phenomenon10 image1)
	(have_image Planet11 spectrograph4)
	(have_image Phenomenon12 spectrograph2)
	(have_image Phenomenon13 image1)
	(have_image Planet14 image1)
))

)

; plan
1. (turn_to satellite2 groundstation3 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 5
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 5
3. (calibrate satellite2 instrument6 groundstation3)
   added: (calibrated instrument6)
   goals met: 0 of 5
4. (turn_to satellite2 phenomenon12 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 phenomenon12)
   goals met: 0 of 5
5. (take_image satellite2 phenomenon12 instrument6 spectrograph2)
   added: (have_image phenomenon12 spectrograph2)
   goals met: 1 of 5
6. (turn_to satellite2 phenomenon10 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon10)
   goals met: 1 of 5
7. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 1 of 5
8. (calibrate satellite3 instrument8 star5)
   added: (calibrated instrument8)
   goals met: 1 of 5
9. (take_image satellite2 phenomenon10 instrument6 image1)
   added: (have_image phenomenon10 image1)
   goals met: 2 of 5
10. (turn_to satellite2 phenomenon13 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon13)
   goals met: 2 of 5
11. (take_image satellite2 phenomenon13 instrument6 image1)
   added: (have_image phenomenon13 image1)
   goals met: 3 of 5
12. (turn_to satellite2 planet14 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 planet14)
   goals met: 3 of 5
13. (take_image satellite2 planet14 instrument6 image1)
   added: (have_image planet14 image1)
   goals met: 4 of 5
14. (turn_to satellite3 planet11 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 planet11)
   goals met: 4 of 5
15. (take_image satellite3 planet11 instrument8 spectrograph4)
   added: (have_image planet11 spectrograph4)
   goals met: 5 of 5
